DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC26XX.c
    Log_print1(Diags_USER1, "UART:(%p) posting write semaphore",
                ((UARTCC26XX_HWAttrs const *)(handle->hwAttrs))->baseAddr);

    Semaphore_post(Semaphore_handle(&(object->writeSem)));
}

/*
 *  ======== readSemCallback ========
 *  Simple callback to post a semaphore for the blocking mode.
 */
static void readSemCallback(UART_Handle handle, void *buffer, size_t count)
{
    UARTCC26XX_Object *object = handle->object;

    Log_print1(Diags_USER1, "UART:(%p) posting read semaphore",
                ((UARTCC26XX_HWAttrs const *)(handle->hwAttrs))->baseAddr);

    Semaphore_post(Semaphore_handle(&(object->readSem)));
}

/*
 *  ======== writeData ========
 *  Write and process data to the UART.
 */
static int32_t writeData(UART_Handle handle, int32_t size)
{
    UARTCC26XX_Object           *object;
    UARTCC26XX_HWAttrs const    *hwAttrs;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /* Send characters until FIFO is full or done. */
    while (size) {
        /* Send the next character and increment counts. */
        if (!UARTCharPutNonBlocking(hwAttrs->baseAddr, *(unsigned char *)(object->writeBuf))) {
            /* Character was not sent */
            break;
        }
        Log_print2(Diags_USER2, "UART:(%p) Wrote character 0x%x",
                   hwAttrs->baseAddr, *(unsigned char *)object->writeBuf);
        object->writeBuf = (unsigned char *)object->writeBuf + 1;
        size--;
        object->writeCount++;
    }
    return (size);
}

/*
 *  ======== readData ========
 *  Read and process data from the UART.
 */
static int32_t readData(UART_Handle handle, int32_t size)
{
    int32_t                     readIn;
    UARTCC26XX_Object           *object;
    UARTCC26XX_HWAttrs const    *hwAttrs;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /* Receive chars until empty or done. */
    while (size && (readIn = (int32_t)UARTCharGetNonBlocking(hwAttrs->baseAddr)) != -1) {

        Log_print2(Diags_USER2, "UART:(%p) Read character 0x%x",
                                 hwAttrs->baseAddr, (uint8_t)readIn);

        /* Update status. */
        *((unsigned char *)object->readBuf) = (uint8_t)readIn;
        object->readBuf = (unsigned char *)object->readBuf + 1;
        object->readCount++;
        size--;
    }
    return (size);
}

/*
 *  ======== readFinishedDoCallback ========
 *  Read finished - make callback
 *
 *  When all expected bytes are received or receive timeout has occured, read
 *  has succeeded. The RX interrupts are disabled and standby is allowed again,
 *  but RX is not disabled. The application should either issue a new read to
 *  ensure we don't get an overflow or call readCancel(...) so the RX is turned
 *  off.
 *
 *  @param(handle)         The UART_Handle for ongoing read.
 */
static void readFinishedDoCallback(UART_Handle handle)
{
    UARTCC26XX_Object           *object;
    UARTCC26XX_HWAttrs const    *hwAttrs;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /*       Release power constraint. */
    threadSafeStdbyDisRelease();

    /*       Disable RX interrupts */
    UARTIntDisable(hwAttrs->baseAddr, UART_INT_OE | UART_INT_BE
                   | UART_INT_PE | UART_INT_FE | UART_INT_RT |
                   UART_INT_RX);

    /* Reset the read buffer so we can pass it back */
    object->readBuf = (unsigned char *)object->readBuf - object->readCount;

    /* Do Callback */
    object->readCallback(handle, object->readBuf,
                         object->readCount);

    Log_print2(Diags_USER1, "UART:(%p) Read finished, %d bytes read",
               hwAttrs->baseAddr, object->readCount);
}

/*
 *  ======== startTxFifoEmptyClk ========
 *  Last write to TX FIFO is done, but not shifted out yet. Start a clock
 *  which will trigger when the TX FIFO should be empty.
 *
 *  @param  handle           The UART_Handle for ongoing write.
 *  @param  numOfDataInFifo  The number of data present in FIFO after last write
 */
static void startTxFifoEmptyClk(UART_Handle handle, unsigned int numOfDataInFifo)
{
    UARTCC26XX_Object           *object;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;

    /* Ensure that the clock is stopped so we can set a new timeout */
    Clock_stop((Clock_Handle) &(object->txFifoEmptyClk));

    /* No more to write, but data is not shiftet out properly yet.
     *   1. Compute appropriate wait time for FIFO to empty out
     *       - 1 bit for start bit
     *       - 5+(object->dataLength) for total data length
     *       - +1 to "map" from stopBits to actual number of bits
     *       - 1000000 so we get 1 us resolution
     *       - 100 (100us) for margin
     */
    unsigned int writeTimeoutUs = (numOfDataInFifo*(1+5+(object->dataLength)+(stopBits[object->stopBits]+1))*1000000)/object->baudRate + 100;
    /*   2. Configure clock object to trigger when FIFO is empty */
    Clock_setTimeout((Clock_Handle) &(object->txFifoEmptyClk), (writeTimeoutUs/Clock_tickPeriod));
    Clock_start((Clock_Handle) &(object->txFifoEmptyClk));
}

/*
 *  ======== writeFinishedDoCallback ========
 *  Write finished - make callback
 *
 *  This function is called when the txFifoEmptyClk times out. The TX FIFO
 *  should now be empty and all bytes have been transmitted. The TX will be
 *  turned off, TX interrupt is disabled and standby is allowed again.
 *
 *  @param(handle)         The UART_Handle for ongoing write.
 */
static void writeFinishedDoCallback(UART_Handle handle)
{
    UARTCC26XX_Object           *object;
    UARTCC26XX_HWAttrs const    *hwAttrs;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /* Stop the txFifoEmpty clock */
    Clock_stop((Clock_Handle) &(object->txFifoEmptyClk));

    /*   Function verifies that the FIFO is empty via BUSY flag */
    /*   If not yet ready start the periodic timer and wait another period*/
    /*   Return.. */
    if(UARTBusy(hwAttrs->baseAddr)){
        /* The UART is still busy.
         * Wait 500 us before checking again or 1 tick period if the
         * Clock_tickPeriod is larger than 500 us.
         */
        Clock_setTimeout((Clock_Handle) &(object->txFifoEmptyClk), MAX((500/Clock_tickPeriod),1));
        Clock_start((Clock_Handle) &(object->txFifoEmptyClk));
        return;
    }

    /* Release constraint since transaction is done */
    threadSafeStdbyDisRelease();

    /* Disable TX interrupt */
    UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX);

    /* Disable TX */
    HWREG(UART0_BASE + UART_O_CTL) &= ~(UART_CTL_TXE);

    /* Reset the write buffer so we can pass it back */
    object->writeBuf = (unsigned char *)object->writeBuf - object->writeCount;

    /* Make callback */
    object->writeCallback(handle, (uint8_t*)object->writeBuf,
                          object->writeCount);
    Log_print2(Diags_USER1, "UART:(%p) Write finished, %d bytes written",
               hwAttrs->baseAddr, object->writeCount);
}

