DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC26XX.c
/*
 *  ======== writeTxFifoFlush ========
 *  Write cancelled or timed out, the TX FIFO must be flushed out.
 *
 *  This function is called either from writeCancel or when a blocking write
 *  has timed out. The HW does not support a simple API for flushing the TX FIFO
 *  so a workaround is done in SW.
 *
 *  @pre The TX FIFO empty clock must have been started in blocking mode.
 *
 *  @param object         Pointer to UART object
 *  @param hwAttrs        Pointer to UART hwAttrs
 */
static void writeTxFifoFlush(UARTCC26XX_Object  *object, UARTCC26XX_HWAttrs const  *hwAttrs)
{
    /*It is not possible to flush the TX FIFO with simple write to HW, doing workaround:
     * 0. Disable TX interrupt
     */
    UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX);
    /* 1. Ensure TX IO will stay high when connected to GPIO */
    PIN_setOutputEnable(hPin, hwAttrs->txPin, 1);
    PIN_setOutputValue(hPin, hwAttrs->txPin, 1);
    /* 2. Disconntect tx from IO, and set it as "GPIO" */
    PINCC26XX_setMux(hPin, hwAttrs->txPin, IOC_PORT_GPIO);
    /* 3. Disconnect cts */
    PINCC26XX_setMux(hPin, hwAttrs->ctsPin, IOC_PORT_GPIO);
    /*4. Wait for TX FIFO to become empty.
     *    CALLBACK: Idle until the TX FIFO is empty, i.e. no longer busy.
     *    BLOCKING: Periodically check if TX is busy emptying the FIFO.
     *              Must be handled at TX FIFO empty clock timeout:
     *                - the timeout/finish function must check the status
     */
    if(object->writeMode == UART_MODE_CALLBACK) {
        /* Wait until the TX FIFO is empty. CALLBACK mode can be used from
         * hwi/swi context, so we cannot use semaphore..
         */
        while(UARTBusy(hwAttrs->baseAddr));
    } else { /* i.e. UART_MODE_BLOCKING */
        /* Pend on semaphore again..(this time forever since we are flushing
         * TX FIFO and nothing should be able to stop it..
         */
        Semaphore_pend(Semaphore_handle(&(object->writeSem)), BIOS_WAIT_FOREVER);
    }
    /* 5. Revert to active pins before returning */
    PINCC26XX_setMux(hPin, hwAttrs->txPin, IOC_PORT_MCU_UART0_TX);
    if(isFlowControlEnabled(hwAttrs)) {
        PINCC26XX_setMux(hPin, hwAttrs->ctsPin, IOC_PORT_MCU_UART0_CTS);
    }
}

/*
 *  ======== UARTCC26XX_hwiIntFxn ========
 *  Hwi function that processes UART interrupts.
 *
 *  Six UART interrupts are enabled when configured for RX: Receive timeout,
 *  receive FIFO is 4/8 full and all four error interrupts.
 *
 *  One interrupt is enabled when configured for TX: Transmit FIFO is 7/8
 *  empty.
 *
 *  The RX and TX can operate independently of each other.
 *
 *  When the read or write is finished they will
 *  post the semaphore or make the callback and log the transfer.
 *
 *  @param  arg         The UART_Handle for this Hwi.
 */
void UARTCC26XX_hwiIntFxn(UArg arg)
{
    unsigned long            intStatus;
    unsigned long            errStatus;
    UARTCC26XX_Object        *object;
    UARTCC26XX_HWAttrs const *hwAttrs;

    /* Get the pointer to the object and hwAttrs */
    object = ((UART_Handle)arg)->object;
    hwAttrs = ((UART_Handle)arg)->hwAttrs;

    /* Clear interrupts */
    intStatus = UARTIntStatus(hwAttrs->baseAddr, true);
    UARTIntClear(hwAttrs->baseAddr, intStatus);

    Log_print2(Diags_USER2, "UART:(%p) Interrupt with mask 0x%x",
                             hwAttrs->baseAddr, intStatus);

    /* Basic error handling */
    if(intStatus & (UART_INT_OE | UART_INT_BE | UART_INT_PE | UART_INT_FE)) {

        /* If overrun, the error bit is set immediately */
        if(intStatus & UART_INT_OE) {
            /* check receive status register */
            errStatus = UARTRxErrorGet(hwAttrs->baseAddr);
            UARTRxErrorClear(hwAttrs->baseAddr);
            /* read out min of readsize and fifo size */
            int32_t bytesToRead = MIN(UARTCC26XX_FIFO_SIZE, object->readSize);
            readData((UART_Handle)arg, bytesToRead);
        }
        else {
            /*
             * else, for break, framing and par. error bits are at error index
             * (we would like to keep the "surviving" bits)
             */
            while(object->readSize > 0) {
                /* read one data */
                readData((UART_Handle)arg, 1);
                /* check receive status register if byte is OK */
                errStatus = UARTRxErrorGet(hwAttrs->baseAddr);
                UARTRxErrorClear(hwAttrs->baseAddr);
                if(errStatus != 0) {
                    /*
                     * last read was not including data, reset data vars
                     * (i.e. upd readBuf pointer, decr readCount)
                     */
                    object->readBuf = (unsigned char *)object->readBuf - 1;
                    object->readCount--;
                    /* the FIFO index with error is reached, stop reading more. */
                    break;
                }
                else {
                    /* current read was not the problem update readSize */
                    object->readSize--;
                }
            }
        }

        /* Report current error status */
        object->status = (UART_Status)errStatus;

        /* Break and clean up any ongoing transaction */
        UARTCC26XX_readCancel((UART_Handle)arg);
    }
    else {
        /*   If RT (Receive Timeout) occured it means we are reading */
        /*   (handle in swi?) */
        if(intStatus & UART_INT_RT) {
            /* Read data from FIFO.*/
            object->readSize = readData((UART_Handle)arg, object->readSize);
            /*     If return partial is set */
            if(object->readRetPartial) {
                /* Partial read accepted, read succeeded by def, set readSize
                * to allow callback to trigger new _read()
                */
                object->readSize = 0;
                /*       Read succeeded */
                readFinishedDoCallback((UART_Handle)arg);
            }
            /*     else - return when all bytes have arrived  */
            else {
            /*       If FIFO contained last bytes */
                if(!object->readSize) {
            /*         Read succeeded  */
                    readFinishedDoCallback((UART_Handle)arg);
                }
            }
        }
        else {
            /* RX interrupt, since CTS is handled by HW */
            if (intStatus & UART_INT_RX) {
                /* Read whatever is less of:
                *   - FIFO_THR bytes - 1 (leave one byte to trigger RT timeout)
                *   - object->readSize (never read more than requested from application)
                * since RT timeout will only trigger if FIFO is not empty.
                */
                int32_t bytesToRead = MIN(object->readFifoThreshold-1, object->readSize);
                /* Do read, all bytes we request to read, are present in FIFO */
                readData((UART_Handle)arg, bytesToRead);
                /* Decrement objec->readSize with the actual number of bytes read
                *  There will always be at least bytesToRead number of bytes in FIFO
                */
                object->readSize -= bytesToRead;
                /*      If FIFO contained last bytes */
                if (!object->readSize) {
                /*        Read succeeded. */
                    readFinishedDoCallback((UART_Handle)arg);
                }
            }
        }
    }
    /* Write if there are characters to be written. */
    if ((intStatus & UART_INT_TX) && object->writeSize) {
        /* Using writtenLast=writeSize before last write
         *(since writeSize=0 when the last finishes)
         */
        uint32_t writtenLast = object->writeSize;
        object->writeSize = writeData((UART_Handle)arg, object->writeSize);
        if(!object->writeSize) {
            /* No more to write, but data is not shiftet out properly yet.
             * Start TX FIFO Empty clock, which will trigger the txFifoEmptyClk
             * function.
             * +UART_TH_FIFO_1_8 because it is 4 bytes left in TX FIFO when the TX FIFO
             * threshold interrupt occurs.
             */
             startTxFifoEmptyClk((UART_Handle)arg, (writtenLast+UART_TH_FIFO_1_8));
        }
    }
}

/*!
 *  @brief UART CC26XX initialization
 *
 *  @pre    Calling context: Hwi, Swi, Task, Main
 *
 *  @param handle  A UART_Handle
 *
 */
void UARTCC26XX_init(UART_Handle handle)
{
    UARTCC26XX_Object           *object;

    /* Get the pointer to the object */
    object = handle->object;
    object->opened = false;

